Autodesk.Revit.DB.RuledFace.IsExtruded
Determines if this is an extruded ruled surface.
Since: 2017

Autodesk.Revit.DB.RuledFace.RulingsAreParallel
Determines if the rulings of this ruled surface are parallel.
Since: 2014

Autodesk.Revit.DB.RuledFace.Point(System.Int32)
Profile points of the surface.

Autodesk.Revit.DB.RuledFace.Curve(System.Int32)
Profile curves of the surface.

Autodesk.Revit.DB.RuledFace
A ruled face of a 3d solid or open shell.
Remarks:  A ruled surface is created by sweeping a line between two profile curves or between a curve and a point (a point and a curve).
For details on the parameterization, refer to the documentation for Autodesk.Revit.DB.RuledSurface.